koshkin-sergey/mbOS/Device/ADI/ADuCM32x/SVD/ADuCM322i.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>MDIO</name>
			<description>MDIO Interface</description>
			<groupName>Communications</groupName>
			<baseAddress>0x40005C00</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0x24</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>MDIO</name>
				<value>14</value>
			</interrupt>
			<registers>
				<register>
					<name>MDCON</name>
					<description>MDIO block control</description>
					<addressOffset>0x00000000</addressOffset>
					<size>0x00000010</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>MD_DRV</name>
							<description>TBD</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<writeConstraint>
								<useEnumeratedValues>true</useEnumeratedValues>
							</writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>MD_DRV_OD</name>
									<description>MDIO drive open drain.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MD_DRV_PP</name>
									<description>MDIO drive push-pull.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MD_PHM</name>
							<description>TBD</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x00000001</maximum>
								</range>
							</writeConstraint>
						</field>
						<field>
							<name>MD_RST</name>
							<description>TBD</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x00000001</maximum>
								</range>
							</writeConstraint>
						</field>
					</fields>
				</register>
				<register>
					<name>MDFRM</name>
					<description>MDIO received frame control information</description>
					<addressOffset>0x00000004</addressOffset>
					<size>0x00000010</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>MD_DEV</name>
							<description>TBD</description>
							<bitOffset>7</bitOffset>
							<bitWidth>5</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x0000001F</maximum>
								</range>
							</writeConstraint>
						</field>
						<field>
							<name>MD_PHY</name>
							<description>TBD</description>
							<bitOffset>2</bitOffset>
							<bitWidth>5</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x0000001F</maximum>
								</range>
							</writeConstraint>
						</field>
						<field>
							<name>MD_OP</name>
							<description>TBD</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<writeConstraint>
								<useEnumeratedValues>true</useEnumeratedValues>
							</writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>MD_OP_ADF</name>
									<description>Address frame.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MD_OP_WRF</name>
									<description>Write frame.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MD_OP_INCF</name>
									<description>PostReadIncAdd frame.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MD_OP_RDF</name>
									<description>Read frame.</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>MDRXD</name>
					<description>MDIO received data</description>
					<addressOffset>0x00000008</addressOffset>
					<size>0x00000010</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>MD_RXD</name>
							<description>TBD</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x0000FFFF</maximum>
								</range>
							</writeConstraint>
						</field>
					</fields>
				</register>
				<register>
					<name>MDADR</name>
					<description>MDIO received address</description>
					<addressOffset>0x0000000C</addressOffset>
					<size>0x00000010</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>MD_ADR</name>
							<description>TBD</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x0000FFFF</maximum>
								</range>
							</writeConstraint>
						</field>
					</fields>
				</register>
				<register>
					<name>MDTXD</name>
					<description>MDIO data for transmission</description>
					<addressOffset>0x00000010</addressOffset>
					<size>0x00000010</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>MD_TXD</name>
							<description>TBD</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x0000FFFF</maximum>
								</range>
							</writeConstraint>
						</field>
					</fields>
				</register>
				<register>
					<name>MDPHY</name>
					<description>MDIO PHYADDR software values and selection and DEVADD</description>
					<addressOffset>0x00000014</addressOffset>
					<size>0x00000010</size>
					<resetValue>0x00000400</resetValue>
					<fields>
						<field>
							<name>MD_DEVADD</name>
							<description>TBD</description>
							<bitOffset>10</bitOffset>
							<bitWidth>5</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x0000001F</maximum>
								</range>
							</writeConstraint>
						</field>
						<field>
							<name>MD_PHYSEL</name>
							<description>TBD</description>
							<bitOffset>5</bitOffset>
							<bitWidth>5</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x0000001F</maximum>
								</range>
							</writeConstraint>
						</field>
						<field>
							<name>MD_PHYSW</name>
							<description>TBD</description>
							<bitOffset>0</bitOffset>
							<bitWidth>5</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x0000001F</maximum>
								</range>
							</writeConstraint>
						</field>
					</fields>
				</register>
				<register>
					<name>MDSTA</name>
					<description>MDIO progress signaling through frame</description>
					<addressOffset>0x00000018</addressOffset>
					<size>0x00000010</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>MD_PHYN</name>
							<description>TBD</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x00000001</maximum>
								</range>
							</writeConstraint>
						</field>
						<field>
							<name>MD_PHYM</name>
							<description>TBD</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x00000001</maximum>
								</range>
							</writeConstraint>
						</field>
						<field>
							<name>MD_DEVN</name>
							<description>TBD</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x00000001</maximum>
								</range>
							</writeConstraint>
						</field>
						<field>
							<name>MD_DEVM</name>
							<description>TBD</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x00000001</maximum>
								</range>
							</writeConstraint>
						</field>
						<field>
							<name>MD_RDF</name>
							<description>TBD</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x00000001</maximum>
								</range>
							</writeConstraint>
						</field>
						<field>
							<name>MD_INCF</name>
							<description>TBD</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x00000001</maximum>
								</range>
							</writeConstraint>
						</field>
						<field>
							<name>MD_ADRF</name>
							<description>TBD</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x00000001</maximum>
								</range>
							</writeConstraint>
						</field>
						<field>
							<name>MD_WRF</name>
							<description>TBD</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x00000001</maximum>
								</range>
							</writeConstraint>
						</field>
					</fields>
				</register>
				<register>
					<name>MDIEN</name>
					<description>MDIO interrupt enables</description>
					<addressOffset>0x0000001C</addressOffset>
					<size>0x00000010</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>MD_PHYNI</name>
							<description>TBD</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x00000001</maximum>
								</range>
							</writeConstraint>
						</field>
						<field>
							<name>MD_PHYMI</name>
							<description>TBD</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x00000001</maximum>
								</range>
							</writeConstraint>
						</field>
						<field>
							<name>MD_DEVNI</name>
							<description>TBD</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x00000001</maximum>
								</range>
							</writeConstraint>
						</field>
						<field>
							<name>MD_DEVMI</name>
							<description>TBD</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x00000001</maximum>
								</range>
							</writeConstraint>
						</field>
						<field>
							<name>MD_RDFI</name>
							<description>TBD</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x00000001</maximum>
								</range>
							</writeConstraint>
						</field>
						<field>
							<name>MD_INCFI</name>
							<description>TBD</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x00000001</maximum>
								</range>
							</writeConstraint>
						</field>
						<field>
							<name>MD_ADRI</name>
							<description>TBD</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x00000001</maximum>
								</range>
							</writeConstraint>
						</field>
						<field>
							<name>MD_WRFI</name>
							<description>TBD</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x00000001</maximum>
								</range>
							</writeConstraint>
						</field>
					</fields>
				</register>
				<register>
					<name>MDPIN</name>
					<description>MDIO read PHYADDR pins</description>
					<addressOffset>0x00000020</addressOffset>
					<size>0x00000010</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>MD_PIN</name>
							<description>TBD</description>
							<bitOffset>0</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-only</access>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x0000001F</maximum>
								</range>
							</writeConstraint>
						</field>
					</fields>
				</register>
