koshkin-sergey/mbOS/Device/ADI/ADuCM32x/SVD/ADuCM322i.svd
				<register>
					<name>GP3SET</name>
					<description>GPIO Port 3 data out set</description>
					<addressOffset>0x00000018</addressOffset>
					<size>0x00000008</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
             <fields>
               <field>
                 <name>SET7</name>
                 <description>Set the output HIGH for the pin</description>
                 <bitOffset>7</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>SET</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>SET6</name>
                 <description>Set the output HIGH for the pin</description>
                 <bitOffset>6</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>SET</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>SET5</name>
                 <description>Set the output HIGH for the pin</description>
                 <bitOffset>5</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>SET</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>SET4</name>
                 <description>Set the output HIGH for the pin</description>
                 <bitOffset>4</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>SET</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>SET3</name>
                 <description>Set the output HIGH for the pin</description>
                 <bitOffset>3</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>SET</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>SET2</name>
                 <description>Set the output HIGH for the pin</description>
                 <bitOffset>2</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>SET</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>SET1</name>
                 <description>Set the output HIGH for the pin</description>
                 <bitOffset>1</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>SET</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>SET0</name>
                 <description>Set the output HIGH for the pin</description>
                 <bitOffset>0</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>SET</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
             </fields>
				</register>
				<register>
					<name>GP3CLR</name>
					<description>GPIO Port 3 data out clear</description>
					<addressOffset>0x0000001C</addressOffset>
					<size>0x00000008</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
             <fields>
               <field>
                 <name>CLR7</name>
                 <description>Set the output low  for the port pin</description>
                 <bitOffset>7</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>CLR</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>CLR6</name>
                 <description>Set the output low  for the port pin</description>
                 <bitOffset>6</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>CLR</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>CLR5</name>
                 <description>Set the output low  for the port pin</description>
                 <bitOffset>5</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>CLR</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>CLR4</name>
                 <description>Set the output low  for the port pin</description>
                 <bitOffset>4</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>CLR</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>CLR3</name>
                 <description>Set the output low  for the port pin</description>
                 <bitOffset>3</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>CLR</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>CLR2</name>
                 <description>Set the output low  for the port pin</description>
                 <bitOffset>2</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>CLR</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>CLR1</name>
                 <description>Set the output low  for the port pin</description>
                 <bitOffset>1</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>CLR</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>CLR0</name>
                 <description>Set the output low  for the port pin</description>
                 <bitOffset>0</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>CLR</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
             </fields>
				</register>
				<register>
					<name>GP3TGL</name>
					<description>GPIO Port 3  pin toggle</description>
					<addressOffset>0x00000020</addressOffset>
					<size>0x00000008</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
             <fields>
               <field>
                 <name>TGL7</name>
                 <description>Toggle the output of the port pin</description>
                 <bitOffset>7</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>TGL</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>TGL6</name>
                 <description>Toggle the output of the port pin</description>
                 <bitOffset>6</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>TGL</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>TGL5</name>
                 <description>Toggle the output of the port pin</description>
                 <bitOffset>5</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>TGL</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>TGL4</name>
                 <description>Toggle the output of the port pin</description>
                 <bitOffset>4</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>TGL</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>TGL3</name>
                 <description>Toggle the output of the port pin</description>
                 <bitOffset>3</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>TGL</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>TGL2</name>
                 <description>Toggle the output of the port pin</description>
                 <bitOffset>2</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>TGL</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>TGL1</name>
                 <description>Toggle the output of the port pin</description>
                 <bitOffset>1</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>TGL</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>TGL0</name>
                 <description>Toggle the output of the port pin</description>
                 <bitOffset>0</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>TGL</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
             </fields>
				</register>
				<register>
					<name>GP3ODE</name>
					<description>GPIO Port 3 open drain enable</description>
					<addressOffset>0x00000024</addressOffset>
					<size>0x00000008</size>
					<resetValue>0x00000000</resetValue>
             <fields>
               <field>
                 <name>ODE7</name>
                 <description>Open drain enable</description>
                 <bitOffset>7</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>ODE6</name>
                 <description>Open drain enable</description>
                 <bitOffset>6</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>ODE5</name>
                 <description>Open drain enable</description>
                 <bitOffset>5</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>ODE4</name>
                 <description>Open drain enable</description>
                 <bitOffset>4</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>ODE3</name>
                 <description>Open drain enable</description>
                 <bitOffset>3</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>ODE2</name>
                 <description>Open drain enable</description>
                 <bitOffset>2</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>ODE1</name>
                 <description>Open drain enable</description>
                 <bitOffset>1</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>ODE0</name>
                 <description>Open drain enable</description>
                 <bitOffset>0</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
             </fields>
         </register>
