koshkin-sergey/mbOS/Device/ADI/ADuCM32x/SVD/ADuCM322i.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>GPIO5</name>
			<description>General Purpose Input Output 5</description>
			<groupName>GPIO</groupName>
			<baseAddress>0x40020240</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0x28</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>GP5CON</name>
					<description>GPIO Port 5  Configuration</description>
					<addressOffset>0x00000000</addressOffset>
					<size>0x00000008</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CON3</name>
							<description>p5.3  configuration bits</description>
							<bitOffset>6</bitOffset>
							<bitWidth>2</bitWidth>
							<writeConstraint>
								<useEnumeratedValues>true</useEnumeratedValues>
							</writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>GPIO</name>
									<description>GPIO</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>VDAC0</name>
									<description>VDAC0</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CON2</name>
							<description>p5.2  configuration bits</description>
							<bitOffset>4</bitOffset>
							<bitWidth>2</bitWidth>
							<writeConstraint>
								<useEnumeratedValues>true</useEnumeratedValues>
							</writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>GPIO</name>
									<description>GPIO</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>VDAC7</name>
									<description>VDAC7</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CON1</name>
							<description>p5.1  configuration bits</description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
							<writeConstraint>
								<useEnumeratedValues>true</useEnumeratedValues>
							</writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>GPIO</name>
									<description>GPIO</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>VDAC6</name>
									<description>VDAC6</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CON0</name>
							<description>p5.0  configuration bits</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<writeConstraint>
								<useEnumeratedValues>true</useEnumeratedValues>
							</writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>GPIO</name>
									<description>GPIO</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>VDAC3</name>
									<description>VDAC3</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>GP5OE</name>
					<description>GPIO Port 5 output enable</description>
					<addressOffset>0x00000004</addressOffset>
					<size>0x00000008</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
                 <name>OE3</name>
                 <description>Pin Output Drive enable</description>
                 <bitOffset>3</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>OE2</name>
                 <description>Pin Output Drive enable</description>
                 <bitOffset>2</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>OE1</name>
                 <description>Pin Output Drive enable</description>
                 <bitOffset>1</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>OE0</name>
							<description>Pin Output Drive enable</description>
							<bitOffset>0</bitOffset>
                 <bitWidth>1</bitWidth>
							<writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
							</writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>GP5PUL</name>
					<description>GPIO Port 5  pull down enable</description>
					<addressOffset>0x00000008</addressOffset>
					<size>0x00000004</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
                 <name>PUL3</name>
                 <description>Pin Pull down enable</description>
                 <bitOffset>3</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>PUL2</name>
                 <description>Pin Pull down enable</description>
                 <bitOffset>2</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>PUL1</name>
                 <description>Pin Pull down enable</description>
                 <bitOffset>1</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>PUL0</name>
							<description>Pin Pull down enable</description>
							<bitOffset>0</bitOffset>
                 <bitWidth>1</bitWidth>
							<writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
							</writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>GP5IE</name>
					<description>GPIO  Port 5 Input Path Enable</description>
					<addressOffset>0x0000000C</addressOffset>
					<size>0x00000004</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
                 <name>IEN3</name>
                 <description>Input path enable</description>
                 <bitOffset>3</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>IEN2</name>
                 <description>Input path enable</description>
                 <bitOffset>2</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>IEN1</name>
                 <description>Input path enable</description>
                 <bitOffset>1</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>IEN0</name>
							<description>Input path enable</description>
							<bitOffset>0</bitOffset>
                 <bitWidth>1</bitWidth>
							<writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
							</writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>GP5IN</name>
					<description>GPIO  Port 5 registered data input</description>
					<addressOffset>0x00000010</addressOffset>
					<size>0x00000004</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
                 <name>IN3</name>
                 <description>Registered data input</description>
                 <bitOffset>3</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>LOW</name>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>HIGH</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>IN2</name>
                 <description>Registered data input</description>
                 <bitOffset>2</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>LOW</name>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>HIGH</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>IN1</name>
                 <description>Registered data input</description>
                 <bitOffset>1</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>LOW</name>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>HIGH</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>IN0</name>
							<description>Registered data input</description>
							<bitOffset>0</bitOffset>
                 <bitWidth>1</bitWidth>
							<writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
							</writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>LOW</name>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>HIGH</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>GP5OUT</name>
					<description>GPIO Port 5 data output</description>
					<addressOffset>0x00000014</addressOffset>
					<size>0x00000004</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
                 <name>OUT3</name>
                 <description>Data out</description>
                 <bitOffset>3</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>LOW</name>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>HIGH</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>OUT2</name>
                 <description>Data out</description>
                 <bitOffset>2</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>LOW</name>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>HIGH</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>OUT1</name>
                 <description>Data out</description>
                 <bitOffset>1</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>LOW</name>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>HIGH</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>OUT0</name>
							<description>Data out</description>
							<bitOffset>0</bitOffset>
                 <bitWidth>1</bitWidth>
							<writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
							</writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>LOW</name>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>HIGH</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>GP5SET</name>
					<description>GPIO Port 5 data out set</description>
					<addressOffset>0x00000018</addressOffset>
					<size>0x00000004</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
                 <name>SET3</name>
                 <description>Set the output HIGH for the pin</description>
                 <bitOffset>3</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>SET</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>SET2</name>
                 <description>Set the output HIGH for the pin</description>
                 <bitOffset>2</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>SET</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>SET1</name>
                 <description>Set the output HIGH for the pin</description>
                 <bitOffset>1</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
							<name>SET</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>SET0</name>
							<description>Set the output HIGH for the pin</description>
							<bitOffset>0</bitOffset>
                 <bitWidth>1</bitWidth>
							<writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
							</writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>SET</name>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
						</field>
					</fields>
				</register>
