koshkin-sergey/mbOS/Device/ADI/ADuCM32x/SVD/ADuCM322i.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>ADC</name>
			<description>Analog to Digital converter</description>
			<groupName>Analog</groupName>
			<baseAddress>0x40082170</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0x3F7C</size>
				<usage>registers</usage>
			</addressBlock>
         <interrupt>
				<name>LVD0</name>
				<value>13</value>
			</interrupt>
         <interrupt>
				<name>LVD1</name>
				<value>49</value>
			</interrupt>
			<registers>
				<register>
					<name>ADCCON</name>
					<description>ADC Configuration</description>
					<addressOffset>0x00000004</addressOffset>
					<size>0x00000010</size>
					<resetValue>0x00000280</resetValue>
					<fields>
						<field>
							<name>SOFT_RESET</name>
							<description>software reset ADC</description>
							<bitOffset>10</bitOffset>
							<bitWidth>6</bitWidth>
							<access>write-only</access>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x0000003F</maximum>
								</range>
							</writeConstraint>
						</field>
						<field>
							<name>PUP</name>
							<description>ADC power up</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x00000001</maximum>
								</range>
							</writeConstraint>
						</field>
						<field>
							<name>REFB_PUP</name>
							<description>ADC reference buffer power up</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x00000001</maximum>
								</range>
							</writeConstraint>
						</field>
						<field>
							<name>Restart_ADC</name>
							<description>Restart ADC, reset Analog Part of ADC</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x00000001</maximum>
								</range>
							</writeConstraint>
						</field>
						<field>
							<name>SEQ_DMA</name>
							<description>DMA request enable for ADC sequence conversion</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x00000001</maximum>
								</range>
							</writeConstraint>
						</field>
						<field>
							<name>CNV_DMA</name>
							<description>DMA request enable for ADC non-sequence conversion</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x00000001</maximum>
								</range>
							</writeConstraint>
						</field>
						<field>
							<name>C_TYPE</name>
							<description>ADC conversion type</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
							<writeConstraint>
								<useEnumeratedValues>true</useEnumeratedValues>
							</writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>NO</name>
									<description>No conversion</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIO</name>
									<description>pin starts conversion (P2.4)</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SINGLE</name>
									<description>Single conversion</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CONT</name>
									<description>Continuous conversion (use this mode for the sequencer)</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PLA</name>
									<description>conversion</description>
									<value>4</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<dim>28</dim>
					<dimIncrement>4</dimIncrement>
					<name>ADCDAT%s</name>
					<description>ADCx Data and flags</description>
					<addressOffset>0x00003E90</addressOffset>
					<size>0x00000020</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>DAT</name>
							<description>ADCx data</description>
							<bitOffset>4</bitOffset>
							<bitWidth>28</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x0FFFFFFF</maximum>
								</range>
							</writeConstraint>
						</field>
						<field>
							<name>VALID</name>
							<description>Flag indicating if data is valid.</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<writeConstraint>
								<useEnumeratedValues>true</useEnumeratedValues>
							</writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>CLR</name>
									<description>Data is Invalid</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>Data is Valid</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OLD</name>
							<description>Flag data has already been read.</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<writeConstraint>
								<useEnumeratedValues>true</useEnumeratedValues>
							</writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>CLR</name>
									<description>Last data has not been read</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>Last data already read</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>ADCCHA</name>
					<description>ADC Channel Select</description>
					<addressOffset>0x00003F10</addressOffset>
					<size>0x00000010</size>
					<resetValue>0x0000111F</resetValue>
					<fields>
						<field>
							<name>ADCCN</name>
							<description>Selects channel for ADC negative input</description>
							<bitOffset>8</bitOffset>
							<bitWidth>5</bitWidth>
							<writeConstraint>
								<useEnumeratedValues>true</useEnumeratedValues>
							</writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>AIN0</name>
									<description>AIN0</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AIN1</name>
									<description>AIN1</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AIN2</name>
									<description>AIN2</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AIN3</name>
									<description>AIN3</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AIN4</name>
									<description>AIN4</description>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AIN5</name>
									<description>AIN5</description>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AIN6</name>
									<description>AIN6</description>
									<value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AIN7</name>
									<description>AIN7</description>
									<value>7</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AIN8</name>
									<description>AIN8</description>
									<value>8</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AIN9</name>
									<description>AIN9</description>
									<value>9</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AIN10</name>
									<description>AIN10</description>
									<value>10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AIN11</name>
									<description>AIN11</description>
									<value>11</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AIN12</name>
									<description>AIN12</description>
									<value>12</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AIN13</name>
									<description>AIN13</description>
									<value>13</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AIN14</name>
									<description>AIN14</description>
									<value>14</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AIN15</name>
									<description>AIN15</description>
									<value>15</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>VREFP_NADC</name>
									<description>: Connect ADC_REFP to negative input.</description>
									<value>16</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>VREFN_NADC</name>
									<description>: Connect ADC_REFN to negative input. Use This setting for single ended measurements.</description>
									<value>17</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AGND</name>
									<description>AGND</description>
									<value>18</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ADCCP</name>
							<description>Select ADC channel</description>
							<bitOffset>0</bitOffset>
							<bitWidth>5</bitWidth>
							<writeConstraint>
								<useEnumeratedValues>true</useEnumeratedValues>
							</writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>AIN0</name>
									<description>AIN0</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AIN1</name>
									<description>AIN1</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AIN2</name>
									<description>AIN2</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AIN3</name>
									<description>AIN3</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AIN4</name>
									<description>AIN4</description>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AIN5</name>
									<description>AIN5</description>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AIN6</name>
									<description>AIN6</description>
									<value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AIN7</name>
									<description>AIN7</description>
									<value>7</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AIN8</name>
									<description>AIN8</description>
									<value>8</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AIN9</name>
									<description>AIN9</description>
									<value>9</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AIN10</name>
									<description>AIN10</description>
									<value>10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AIN11</name>
									<description>AIN11</description>
									<value>11</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AIN12</name>
									<description>AIN12</description>
									<value>12</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AIN13</name>
									<description>AIN13</description>
									<value>13</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AIN14</name>
									<description>AIN14</description>
									<value>14</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AIN15</name>
									<description>AIN15</description>
									<value>15</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TEMP_SENSOR</name>
									<description>TEMP_SENSOR</description>
									<value>22</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>VREFP_PADC</name>
									<description>: Connect ADC_REFP to positive input. Note: This pin should not be measured relative to AGND. This selection is intended for measuring the differential voltage between the negative input and ADC_REFP.</description>
									<value>23</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>IOVDD_2</name>
									<description>: Use this to measure half of the IOVDD supply voltage</description>
									<value>25</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AVDD_2</name>
									<description>: Use this to measure half of the AVDD supply voltage.</description>
									<value>26</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>VREFN_PADC</name>
									<description>: Connect ADC_REFN to positive input.</description>
									<value>27</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>ADCSEQ</name>
					<description>ADC Sequencer Control</description>
					<addressOffset>0x00003F18</addressOffset>
					<size>0x00000020</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>ST</name>
							<description>Sequence restart, used to force sequence to start at first channel when sequence is working</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x00000001</maximum>
								</range>
							</writeConstraint>
						</field>
						<field>
							<name>EN</name>
							<description>Sequence enable</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x00000001</maximum>
								</range>
							</writeConstraint>
						</field>
						<field>
							<name>CH</name>
							<description>Select channels included in sequence operation.</description>
							<bitOffset>0</bitOffset>
							<bitWidth>29</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x1FFFFFFF</maximum>
								</range>
							</writeConstraint>
						</field>
					</fields>
				</register>
				<register>
					<name>ADCSEQC</name>
					<description>ADC Sequencer Configuration</description>
					<addressOffset>0x00003F1C</addressOffset>
					<size>0x00000020</size>
					<resetValue>0x0008C631</resetValue>
					<fields>
						<field>
							<name>T</name>
							<description>Define programmable delay of 0 to 254 between sequences. A delay 255 will cause a halt after one sequence.</description>
							<bitOffset>20</bitOffset>
							<bitWidth>8</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x000000FF</maximum>
								</range>
							</writeConstraint>
						</field>
						<field>
							<name>DIF6</name>
							<description>Selects differential mode negative input for AIN6 in the sequence.</description>
							<bitOffset>15</bitOffset>
							<bitWidth>5</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x0000001F</maximum>
								</range>
							</writeConstraint>
						</field>
						<field>
							<name>DIF4</name>
							<description>Selects differential mode negative input for AIN4 in the sequence.</description>
							<bitOffset>10</bitOffset>
							<bitWidth>5</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x0000001F</maximum>
								</range>
							</writeConstraint>
						</field>
						<field>
							<name>DIF2</name>
							<description>Selects differential mode negative input for AIN2 in the sequence.</description>
							<bitOffset>5</bitOffset>
							<bitWidth>5</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x0000001F</maximum>
								</range>
							</writeConstraint>
						</field>
						<field>
							<name>DIF0</name>
							<description>Selects differential mode negative input for AIN0 in the sequence.</description>
							<bitOffset>0</bitOffset>
							<bitWidth>5</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x0000001F</maximum>
								</range>
							</writeConstraint>
						</field>
					</fields>
				</register>
				<register>
					<name>ADCGN</name>
					<description>User gain adjust</description>
					<addressOffset>0x00003F20</addressOffset>
					<size>0x00000010</size>
					<resetValue>0x00002000</resetValue>
					<fields>
						<field>
							<name>GN</name>
							<description>User gain register</description>
							<bitOffset>0</bitOffset>
							<bitWidth>14</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x00003FFF</maximum>
								</range>
							</writeConstraint>
						</field>
					</fields>
				</register>
				<register>
					<name>ADCOF</name>
					<description>User offset adjust</description>
					<addressOffset>0x00003F24</addressOffset>
					<size>0x0000000E</size>
					<resetValue>0x00002000</resetValue>
					<fields>
						<field>
							<name>OF</name>
							<description>User offset register</description>
							<bitOffset>0</bitOffset>
							<bitWidth>14</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x00003FFF</maximum>
								</range>
							</writeConstraint>
						</field>
					</fields>
				</register>
				<register>
					<name>ADCCMP</name>
					<description>Digital comparator configuration</description>
					<addressOffset>0x00003F28</addressOffset>
					<size>0x00000012</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>THR</name>
							<description>Digital compare threshold</description>
							<bitOffset>2</bitOffset>
							<bitWidth>16</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x0000FFFF</maximum>
								</range>
							</writeConstraint>
						</field>
						<field>
							<name>DIR</name>
							<description>Select digital comparator direction</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<writeConstraint>
								<useEnumeratedValues>true</useEnumeratedValues>
							</writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<description>ADCTH less than channel 4 data</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<description>ADCTH larger than channel 4 data</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EN</name>
							<description>Digital comparator enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<writeConstraint>
								<useEnumeratedValues>true</useEnumeratedValues>
							</writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<description>Disable</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<description>Enable</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>ADCCNVC</name>
					<description>ADC conversion  configuration</description>
					<addressOffset>0x00003F2C</addressOffset>
					<size>0x00000020</size>
					<resetValue>0x000A00C8</resetValue>
					<fields>
						<field>
							<name>CNVD</name>
							<description>Configure ADC Acquisition time and sampling time</description>
							<bitOffset>16</bitOffset>
							<bitWidth>10</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x000003FF</maximum>
								</range>
							</writeConstraint>
						</field>
						<field>
							<name>CNVC</name>
							<description>Configure Conversion frequency</description>
							<bitOffset>0</bitOffset>
							<bitWidth>10</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x000003FF</maximum>
								</range>
							</writeConstraint>
						</field>
					</fields>
				</register>
