koshkin-sergey/mbOS/Device/ADI/ADuCM32x/SVD/ADuCM322i.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>InBuf</name>
			<description>Input Buffer</description>
			<groupName>Analog</groupName>
			<baseAddress>0x40081400</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0x2014</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>IBUFCON</name>
					<description>InBuf control register</description>
					<addressOffset>0x00000000</addressOffset>
					<size>0x00000010</size>
					<resetValue>0x0000000F</resetValue>
					<fields>
						<field>
							<name>IBUF_CHOP</name>
							<description>CHOPINBUF enable the chop per InBuf separately</description>
							<bitOffset>4</bitOffset>
							<bitWidth>2</bitWidth>
							<writeConstraint>
								<useEnumeratedValues>true</useEnumeratedValues>
							</writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>OFF</name>
									<description>Chopping disabled on both buffers.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>NSIDE</name>
									<description>Chopping enabled on N-side only. P-side Disabled.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PSIDE</name>
									<description>Chopping enabled on P-side only. N-side Disabled.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>BOTH</name>
									<description>Chopping enabled on both buffers.</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IBUF_PD</name>
							<description>Power down P/N InBuf separately</description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
							<writeConstraint>
								<useEnumeratedValues>true</useEnumeratedValues>
							</writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>NONE</name>
									<description>Both sides powered on</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>NSIDE</name>
									<description>only N side powered down</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PSIDE</name>
									<description>only P side powered down</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>BOTH</name>
									<description>Both sides powered down</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IBUF_BYP</name>
							<description>Bypass P/N InBuf seperately</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<writeConstraint>
								<useEnumeratedValues>true</useEnumeratedValues>
							</writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>NONE</name>
									<description>Bypass none sided</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>NSIDE</name>
									<description>N side bypassed</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PSIDE</name>
									<description>P side bypassed</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>BOTH</name>
									<description>Bypass both</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
		<peripheral>
			<name>LV</name>
			<description>Low voltage die ID</description>
			<groupName>ID</groupName>
			<baseAddress>0x40082C30</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0x4</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>LVID</name>
					<description>Low voltage die ID</description>
					<addressOffset>0x00000000</addressOffset>
					<size>0x00000010</size>
					<access>read-only</access>
					<resetValue>0x00000071</resetValue>
					<fields>
						<field>
							<name>LVID</name>
							<description>LVID comes from hardware coded logic</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x0000FFFF</maximum>
								</range>
							</writeConstraint>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
		<peripheral>
			<name>LV_RST</name>
			<description>Low voltage die reset configuration</description>
			<groupName>Analog</groupName>
			<baseAddress>0x40082C34</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0x4</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>LVRST</name>
					<description>LV die reset configuration</description>
					<addressOffset>0x00000000</addressOffset>
					<size>0x00000010</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>RETAIN</name>
							<description>LV retains status after WDT and software reset</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<writeConstraint>
								<useEnumeratedValues>true</useEnumeratedValues>
							</writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>EN</name>
									<description>LV die retains status after watchdog or software reset.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIS</name>
									<description>LV die does not retain status after watchdog or software reset.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
