koshkin-sergey/mbOS/Device/ADI/ADuCM32x/SVD/ADuCM322i.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>LV_INT</name>
			<description>Low voltage die interrupt configuration</description>
			<groupName>Analog</groupName>
			<baseAddress>0x40083004</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0xC</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>INTCLR</name>
					<description>Interrupt clear register</description>
					<addressOffset>0x00000000</addressOffset>
					<size>0x00000010</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CLR_WRECC_ERR</name>
							<description>Write 1 to this bit to clear the write ECC error interrupt flag</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x00000001</maximum>
								</range>
							</writeConstraint>
						</field>
						<field>
							<name>CLR_RDECC_ERR</name>
							<description>Write 1 to this bit to clear the read ECC error interrupt flag</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x00000001</maximum>
								</range>
							</writeConstraint>
						</field>
						<field>
							<name>CLR_ACOMP</name>
							<description>Write 1 to this bit to clear the analog compare interrupt flag</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x00000001</maximum>
								</range>
							</writeConstraint>
						</field>
						<field>
							<name>CLR_DCOMP</name>
							<description>Write 1 to this bit to clear the digital compare interrupt flag</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x00000001</maximum>
								</range>
							</writeConstraint>
						</field>
						<field>
							<name>CLR_ADC_SEQ</name>
							<description>Write 1 to this bit to clear the ADC sequence conversion interrupt flag</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x00000001</maximum>
								</range>
							</writeConstraint>
						</field>
						<field>
							<name>CLR_ADC_SOFTCONV</name>
							<description>Write 1 to this bit to clear the ADC software conversion interrupt flag</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x00000001</maximum>
								</range>
							</writeConstraint>
						</field>
					</fields>
				</register>
				<register>
					<name>INTSEL</name>
					<description>Interrupt mask register</description>
					<addressOffset>0x00000004</addressOffset>
					<size>0x00000010</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>SEL_WRECC_ERR_0</name>
							<description>Write 1 to this bit to enable write ECC error interrupt for interrupt pin 0</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x00000001</maximum>
								</range>
							</writeConstraint>
						</field>
						<field>
							<name>SEL_RDECC_ERR_0</name>
							<description>Write 1 to this bit to enable read ECC error interrupt for interrupt pin 0</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x00000001</maximum>
								</range>
							</writeConstraint>
						</field>
						<field>
							<name>SEL_ACOMP_0</name>
							<description>Write 1 to this bit to enable analog comparator interrupt for interrupt pin 0</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x00000001</maximum>
								</range>
							</writeConstraint>
						</field>
						<field>
							<name>SEL_DCOMP_0</name>
							<description>Write 1 to this bit to enable digital comparator interrupt for interrupt pin 0</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x00000001</maximum>
								</range>
							</writeConstraint>
						</field>
						<field>
							<name>SEL_ADC_SEQ_0</name>
							<description>Write 1 to this bit to enable ADC sequence conversion interrupt for interrupt pin 0</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x00000001</maximum>
								</range>
							</writeConstraint>
						</field>
						<field>
							<name>SEL_ADC_SOFTCONV_0</name>
							<description>Write 1 to this bit to enable ADC software conversion interrupt for interrupt pin 0</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x00000001</maximum>
								</range>
							</writeConstraint>
						</field>
						<field>
							<name>SEL_WRECC_ERR_1</name>
							<description>Write 1 to this bit to enable write ECC error interrupt for interrupt pin 1</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x00000001</maximum>
								</range>
							</writeConstraint>
						</field>
						<field>
							<name>SEL_RDECC_ERR_1</name>
							<description>Write 1 to this bit to enable read ECC error interrupt for interrupt pin 1</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x00000001</maximum>
								</range>
							</writeConstraint>
						</field>
						<field>
							<name>SEL_ACOMP_1</name>
							<description>Write 1 to this bit to enable analog comparator interrupt for interrupt pin 1</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x00000001</maximum>
								</range>
							</writeConstraint>
						</field>
						<field>
							<name>SEL_DCOMP_1</name>
							<description>Write 1 to this bit to enable digital comparator interrupt for interrupt pin 1</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x00000001</maximum>
								</range>
							</writeConstraint>
						</field>
						<field>
							<name>SEL_ADC_SEQ_1</name>
							<description>Write 1 to this bit to enable ADC sequence conversion interrupt for interrupt pin 1</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x00000001</maximum>
								</range>
							</writeConstraint>
						</field>
						<field>
							<name>SEL_ADC_SOFTCONV_1</name>
							<description>Write 1 to this bit to enable ADC software conversion interrupt for interrupt pin 1</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x00000001</maximum>
								</range>
							</writeConstraint>
						</field>
					</fields>
				</register>
				<register>
					<name>INTSTA</name>
					<description>Interrupt status register</description>
					<addressOffset>0x00000008</addressOffset>
					<size>0x00000010</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>WRECC_ERR</name>
							<description>Write data ECC error interrupt status</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x00000001</maximum>
								</range>
							</writeConstraint>
						</field>
						<field>
							<name>RDECC_ERR</name>
							<description>Read data ECC error interrupt status</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x00000001</maximum>
								</range>
							</writeConstraint>
						</field>
						<field>
							<name>ACOMP</name>
							<description>Analog comparator interrupt status</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x00000001</maximum>
								</range>
							</writeConstraint>
						</field>
						<field>
							<name>DCOMP</name>
							<description>Digital comparator interrupt status</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x00000001</maximum>
								</range>
							</writeConstraint>
						</field>
						<field>
							<name>ADC_SEQ</name>
							<description>ADC sequence interrupt status</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x00000001</maximum>
								</range>
							</writeConstraint>
						</field>
						<field>
							<name>ADC_SOFTCONV</name>
							<description>ADC software conversion  interrupt status</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<writeConstraint>
								<range>
									<minimum>0x00000000</minimum>
									<maximum>0x00000001</maximum>
								</range>
							</writeConstraint>
						</field>
					</fields>
				</register>
